---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CircularFramingDiameter
source: html/83f822d9-2637-4585-1e28-08f08940e923.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CircularFramingDiameter Property

"Circular Diameter"

## Syntax (C#)
```csharp
public static ForgeTypeId CircularFramingDiameter { get; }
```